{include file=header.tpl}
<a class=data>
{if $error5}
Не достатньо питань для генерацiї Тесту або Блоку тестiв!<br />
Це означає, що теста фактично не існує. Тобто в базу даних занесено малу кількість завдань.<br />
Можливо не втановлено рівні для тесту чи блоку тестів, в блок тестів не добалено жодного тесту. <br />
Повідомте про цю помилку викладачу або адміністратору.<br />
<a href="index.php">Повторiть спробу.</a><br />
{/if}
{if $warning1}
<a class=data>Вибраний тест Ви вже проходили!!!</a><br />
і отримали оцінку {$old_result}!<br />
{/if}
{if $warning2}
Ще не настав час здачі тесту!!!<br />
Це означає, що тест Ви зможете пройти лише в демонстраційному режимі.<br />
Отриманий результат не буде зафіксовано в журналі результатів.<br />
Таким чином Ви можете оцінити лише свій рівень знань.<br />
{/if}
</a>
<button type="button" onclick="{$GEN_FUNCTION}">{$ACTION_STRING}</button>
<hr />
<br />{$TASK_BODY}
{include file=footer.tpl}